{
    "name":"Formal Communication",
    "category":
    [
        {
            "name": "Intent",
            "section":[
              {"name":"Clearly conveys the purpose, and the content is well-aligned towards this intent",
              "type": "radio",
              "values" : [
                  {"name":"0", "desc":"No"},
                  {"name":"1", "desc":"Minimally"},
                  {"name":"2"},
                  {"name":"3", "desc": "Partially"},
                  {"name":"4"},
                  {"name":"5", "desc": "Completely"}
              ]},
              {"name":"Observable Characteristics",
                "type": "checkbox",
                "values": [
                {"name": "a", "desc": "Clearly stated what the audience should gain from the communication"},
                {"name": "b", "desc": "Used each part of the communication to convey or support the main message"},
                {"name": "c", "desc": "Concluded by summarizing what was to be learned"}
              ]},
              {"name" : "Suggestions for Improvement",
                "type" : "text",
                "values": [
              {"name": "a)", "desc": "Decide if your main purpose is to inform, to persuade, to argue, to summarize, to entertain, to inspire, etc."},
              {"name": "b)", "desc": "Write out the intent of the communication you are creating and refer back to it as you generate your material."},
              {"name": "c)", "desc": "Make sure the purpose of the communication is presented early to orient your audience to the focus of the communication."},
              {"name": "d)", "desc": "Check that the focus of each segment is clearly linked to the main message or intent of the communication."},
              {"name": "e)", "desc": "Summarize the main ideas to wrap up the presentation (refer back to the initial statement(s) of what was to be learned)."}
            ]}
          ]
        },
        {
            "name": "Audience",
            "section": [
              {
                "name" : "Uses language and delivery style that is consistent with the norms of the subject area and suitable for the audience",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                {"name":"1", "desc":"Rarely"},
                {"name":"2"},
                {"name":"3", "desc":"Sometimes"},
                {"name":"4"},
                {"name":"5", "desc":"Consistently"}
            ]},
              {
                "name" : "Observed Characteristics",
                "type" : "checkbox",
                "values": [
                {"name": "a", "desc": "Communicated to the full range of the audience, including noivces and those "},
                {"name": "b", "desc": "Aligned the communication with interests and background of the particular audience"},
                {"name": "c", "desc": "Used vocabulary that aligned with the discipline and was understood by the audience"}
              ]},
              {
                "name":"Suggestions for Improvement",
                "type": "text",
                "values": [
                {"name": "a)", "desc": "Identify the range and level of expertise and interest your audience has for the topic and design your communication to have aspects that will engage all members of the audience."},
                {"name": "b)", "desc": "Identify what the audience needs to know to understand the narrative."},
                {"name": "c)", "desc": "Plan how you will interpret key data or details in a meaningful way for non-experts."},
                {"name": "d)", "desc": "Only use jargon when it is understood readily by most members of your audience, and it makes the communication more effective and succinct."},
                {"name": "e)", "desc": "Check that the vocabulary, sentence structure, and tone used in your communication is aligned with the level of your audience.."},
                {"name": "e)", "desc": "Collect feedback from others on drafts to make sure the core message of the communication is easily understood."}
              ]}
          ]
        },
        {
            "name": "Organization",
            "section": [
              {
                "name" : "Presents ideas in a logical and cohesive manner",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                  {"name":"1", "desc":"Rarely"},
                  {"name":"2"},
                  {"name":"3", "desc":"Sometimes"},
                  {"name":"4"},
                  {"name":"5", "desc":"Consistently"}
              ]},
              {
                "name" : "Observed Characteristics",
                "type" : "checkbox",
                "values" : [
                {"name": "a", "desc": "There was a clear story arc that moved the communication foward"},
                {"name": "b", "desc": "Organizational cues and transitions clearly indicated the structure of the communication"},
                {"name": "c", "desc": "Sequence of ideas flowed in an order that was easy to follow"}
              ]},
              {
                "name" : "Suggestions",
                "type" : "text",
                "values" : [
                  {"name": "a)", "desc": "Consider the ‘story’ that you want to tell. Ask yourself what’s the main message you want the audience to leave with."},
                  {"name": "b)", "desc": "Identify the critical points for the story (do this before you prepare the actual communication) and map out the key points."},
                  {"name": "c)", "desc": "Summarize sections before transitioning to the next topic."},
                  {"name": "d)", "desc": "Repeat key ideas to ensure the audience can follow the main idea."},
                  {"name": "e)", "desc": "Make sure that you introduce prerequisite information early in the communication."},
                  {"name": "f)", "desc": "Try more than one order for the topics, to see if overall flow is improved."}
                ]}
              ]
          },
          {
            "name": "Visual Representation",
            "section": [
              {
                "name" : "Constructs and uses visual representations effectively and appropriately",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                  {"name":"1", "desc":"Rarely"},
                  {"name":"2"},
                  {"name":"3", "desc":"Sometimes"},
                  {"name":"4"},
                  {"name":"5", "desc":"Consistently"}
              ]},
              {
                "name" : "Observable Characteristics",
                "type" : "checkbox",
                "values" : [
                {"name": "a", "desc": "Each figure conveyed a clear message"},
                {"name": "b", "desc": "Details of visual representation were easily interpreted by the audience"},
                {"name": "c", "desc": "The use of visual enhanced understanding by the audience"}
              ]},
              {
                "name" : "Suggestions for Improvement",
                "type" : "text",
                "values" : [
                  {"name": "a)", "desc": "Plan what types of figures are needed to support the narrative - consider writing out a figure description before you construct it."},
                  {"name": "b)", "desc": "Avoid including unnecessary details that detract from the intended message."},
                  {"name": "c)", "desc": "Consider how many messages each visual is trying to convey and divide up if the complexity or density is overwhelming."},
                  {"name": "d)", "desc": "Be sure labels, text, and small details can be easily read."},
                  {"name": "e)", "desc": "Provide a caption that helps interpret the key aspects of the visual."},
                  {"name": "f)", "desc": "Seek feedback on visuals to gauge initial reaction and ease of interpretation."}
                ]}
              ]
          },
          {
            "name": "Format and Style",
            "section": [
              {
                "name" : "Selects a format style that enhances the effectiveness of the communication",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                  {"name":"1", "desc":"Rarely"},
                  {"name":"2"},
                  {"name":"3", "desc":"Sometimes"},
                  {"name":"4"},
                  {"name":"5", "desc":"Consistently"}
              ]},
              {
                "name" : "Observable Characteristics",
                "type" : "checkbox",
                "values" : [
                {"name": "a", "desc": "Stylistic elements were aesthetically pleasing and did not distract from the message"},
                {"name": "b", "desc": "Stylistic elements were designed to make the communication accessible to the audience (size, colors, contrasts, etc.)"},
                {"name": "c", "desc": "The level of formality of the communication aligns with the setting, context, and purpose"}
              ]},
              {
                "name" : "Suggestions for Improvement",
                "type" : "text",
                "values" : [
                  {"name": "a)", "desc": "Use titles (headers) and subtitles (subheaders) to orient the audience and help them follow the narrative."},
                  {"name": "b)", "desc": "Look at pages or slides as a whole for an easy-to-read layout, such as white space, headers, line spacing, etc."},
                  {"name": "c)", "desc": "Use emphases where needed to direct audience attention to important aspects."},
                  {"name": "d)", "desc": "Use colors to carefully highlight or call attention to key elements to enhance your narrative without distracting from your message."},
                  {"name": "e)", "desc": "Make sure that text, figures, and colors are readable and accessible for all."},
                  {"name": "f)", "desc": "Seek feedback to confirm that the language, tone, and style of your communication match the level of formality needed for your context and purpose."}
                ]}
              ]
          },
          {
            "name": "Mechanics (written words)",
            "section": [
              {
                "name" : "Uses expected writing conventions for the form of communication",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                  {"name":"1", "desc":"Rarely"},
                  {"name":"2"},
                  {"name":"3", "desc":"Sometimes"},
                  {"name":"4"},
                  {"name":"5", "desc":"Consistently"}
              ]},
              {
                "name" : "Observable Characteristics",
                "type" : "checkbox",
                "values" : [
                {"name": "a", "desc": "Writing contained correct spelling, word choice, punctuation, captialization"},
                {"name": "b", "desc": "All phrases and sentences were grammatically correct"},
                {"name": "c", "desc": "All paragraphs (or slides) were well constructed around a central idea"},
                {"name": "d", "desc": "All figures and tables were called out in the narrative, and sources were correctly cited"}
              ]},
              {
                "name" : "Suggestions for Improvement",
                "type" : "text",
                "values" : [
                  {"name": "a)", "desc": "Proofread your writing for spelling errors, punctuation, autocorrects, etc."},
                  {"name": "b)", "desc": "Review sentence structure for subject-verb agreement, consistent tense, run on sentences, and other structural problems."},
                  {"name": "c)", "desc": "Verify that items in lists are parallel."},
                  {"name": "d)", "desc": "List the themes of each paragraph (or slide). If there are more than 2, consider starting a new paragraph (or slide)."},
                  {"name": "e)", "desc": "Confirm that each figure, table, etc has been numbered consecutively and has been called out and discussed further in the narrative."},
                  {"name": "f)", "desc": "Confirm that all work that has been published elsewhere or ideas/data that were not generated by the author(s) has been properly cited using appropriate convetions."},
                  {"name": "g)", "desc": "Ask someone else to review and provide feedback on your work."}
                ]}
              ]
          },
          {
            "name": "Delivery (oral)",
            "section": [
              {
                "name" : "Uses voice and body language to convey the intended message in a clear and engaging manner",
                "type" : "radio",
                "values" : [
                  {"name":"0", "desc":"No evidence"},
                  {"name":"1", "desc":"Rarely"},
                  {"name":"2"},
                  {"name":"3", "desc":"Sometimes"},
                  {"name":"4"},
                  {"name":"5", "desc":"Consistently"}
              ]},
              {
                "name" : "Observable Characteristics",
                "type" : "checkbox",
                "values" : [
                  {"name": "a", "desc": "Spoke loudly and clearly with a tone that indicated confidence and interest in the subject"},
                  {"name": "b", "desc": "Vocal tone and pacing helped maintain audience interest"},
                  {"name": "c", "desc": "Gestures and visual cues further oriented the audience to focus on particular items or messages"},
                  {"name": "d", "desc": "Body language directed the elivery toward the audience and indicated the speaker was open to engagement."}
              ]},
              {
                "name" : "Suggestions for Improvement",
                "type" : "text",
                "values" : [
                  {"name": "a)", "desc": "Practice for others or record your talk;"},
                    {"name": "i.", "desc": "be sure that your voice can be heard, and your word pronunciations are clear."},
                    {"name": "ii.", "desc": "listen for “ums”, “like”, or other verbal tics/filler words that can detract from your message."},
                    {"name": "iii.", "desc": "observe your natural body language, gestures, and stance in front of the audience to be sure that they express confidence and enhance your message."},
                  {"name": "b)", "desc": "Add variety to your speed or vocal tone to emphasize key points or transitions."},
                  {"name": "c)", "desc": "Try to communicate/engage as if telling a story or having a conversation with the audience."},
                  {"name": "d)", "desc": "Face the audience and do not look continuously at the screen or notes."},
                  {"name": "e)", "desc": "Make eye contact with multiple members of the audience."}
                ]}
              ]
          }
    ],
  "showName": "true"
}